t6/freebsd-runit/docs/svclone.8
.Dd April 13, 2018
.Dt SVCLONE 8
.Os
.Sh NAME
.Nm svclone
.Nd "clone Runit services"
.Sh SYNOPSIS
.Nm
.Op Fl crsu
.Ar svdir ...
.Nm
.Op Fl u
.Ar source target ...
.Sh DESCRIPTION
.Bl -tag -width indent
.It Fl c
Create new service stubs instead of cloning an existing service.
.It Fl r
Remove supervise links from services.
.It Fl s
Regenerate and update all
.Pa supervise
links.
.It Fl u
Let created or updated supervise symlinks point into
.Pa /var/run/runit/users/$USER
instead of
.Pa /var/run/runit .
This is useful for user level services as users cannot normally write
into
.Pa /var/run/runit .
.El
.Pp
The
.Pa supervise
symlinks are all created as relative symlinks.
After moving a service you must regenerate them so that they point
into a valid location.
.Sh EXAMPLES
Create a user
.Xr runsvdir 8
service to let kate run her own custom services (managed via
.Pa ~/service )
when the system boots up:
.Bd -literal -offset indent
mkdir /usr/local/etc/sv/local
svclone /usr/local/etc/sv/{runsvdir-user-template,local/runsvdir-kate}
ln -s /usr/local/etc/sv/local/runsvdir-kate /var/service
.Ed
.Pp
kate can now create, enable, and manage a user-level sndiod instance by herself:
.Bd -literal -offset indent
mkdir ~/.sv ~/service
svclone -u /usr/local/etc/sv/sndiod ~/.sv/sndiod
ln -s ~/.sv/sndiod ~/service
.Ed
.Pp
After moving an existing service to a new parent directory the
relative supervise symlink will point to nowhere.
Make sure to update and regenerate it afterwards.
.Bd -literal -offset indent
svclone -s /usr/local/etc/sv/local/my-service
.Ed
.Sh SEE ALSO
.Xr ln 1 ,
.Xr runsvdir 8 ,
.Xr sv 8
.Sh AUTHORS
.An Tobias Kortkamp Aq Mt tobik@FreeBSD.org
