t6/freebsd-runit/docs/svclone.8
.Dd June 09, 2019
.Dt SVCLONE 8
.Os
.Sh NAME
.Nm svclone
.Nd "clone Runit services"
.Sh SYNOPSIS
.Nm
.Op Fl crsu
.Ar svdir ...
.Nm
.Op Fl u
.Ar source target ...
.Sh DESCRIPTION
.Bl -tag -width indent
.It Fl c
Create new service stubs instead of cloning an existing service.
.It Fl r
Remove supervise links from services.
.It Fl s
Regenerate and update all
.Pa supervise
links.
.It Fl t
When cloning a service treat
.Ar source
as a template:
.Pa %%SVDIR%%/$source-template
.It Fl u
Let created or updated supervise symlinks point into
.Pa /var/run/runit/users/$USER
instead of
.Pa /var/run/runit .
This is useful for user level services as users cannot normally write
into
.Pa /var/run/runit .
.El
.Sh EXAMPLES
Create a user
.Xr runsvdir 8
service to let kate run her own custom services (managed via
.Pa ~/service )
when the system boots up:
.Bd -literal -offset indent
mkdir %%SVDIR%%/local
svclone %%SVDIR%%/{runsvdir-user-template,local/runsvdir@kate}
ln -s %%SVDIR%%/local/runsvdir@kate /var/service
.Ed
.Pp
Or the same but using
.Fl t :
.Bd -literal -offset indent
mkdir %%SVDIR%%/local
svclone -t runsvdir-user local/runsvdir@kate
ln -s %%SVDIR%%/local/runsvdir@kate /var/service
.Ed
.Pp
kate can now create, enable, and manage a user-level sndiod instance by herself:
.Bd -literal -offset indent
mkdir ~/.sv ~/service
svclone -u %%SVDIR%%/sndiod ~/.sv/sndiod
ln -s ~/.sv/sndiod ~/service
.Ed
.Sh SEE ALSO
.Xr ln 1 ,
.Xr runsvdir 8 ,
.Xr sv 8
.Sh AUTHORS
.An Tobias Kortkamp Aq Mt tobik@FreeBSD.org
