t6/freebsd-runit/docs/svmod.8
.Dd December 26, 2018
.Dt SVMOD 8
.Os
.Sh NAME
.Nm svmod
.Nd "helper to control user access to runsv services"
.Sh SYNOPSIS
.Nm
.Ar user:group
.Ar svdir ...
.Nm
.Ar user
.Ar svdir ...
.Nm
.Ar :group
.Ar svdir ...
.Sh DESCRIPTION
.Xr runsv 8
allows for setting fine-grained permissions on its
.Pa control
pipe, to give users the ability to control a service.
.Nm
is a small helper that you can use in your service files that
simplifies setting the right permission.
.Sh EXAMPLES
Give control access to the user
.Sy kate
In the services'
.Pa run
script or
.Pa conf
file:
.Bd -literal -offset indent
svmod kate . ./log
.Ed
.Pp
.Sy kate
can now control (start, restart, take down, etc.) and check the
service's state with
.Xr sv 8 ,
including the attached log service.
.Sh SEE ALSO
.Xr sv 8
.Sh AUTHORS
.An Tobias Kortkamp Aq Mt tobik@FreeBSD.org
